CoreMaker-lab/STM32C542_LSM6DSV80X_LIS2MDL/STM32C5_LSM6DSV80X_Project2/STM32C5_LSM6DSV80X_Project2_cmake/generated/hal/mx_gpio_default.h
/**
  ******************************************************************************
  * @file           : mx_gpio_default.h
  * @brief          : Header for mx_gpio_default.c file.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the mx_stm32c5xx_hal_drivers_license.md file
  * in the same directory as the generated code.
  * If no mx_stm32c5xx_hal_drivers_license.md file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MX_GPIO_DEFAULT_H
#define MX_GPIO_DEFAULT_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"
#include "mx_def.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/******************************************************************************/
/* Exported defines for gpio_default in HAL layer                             */
/******************************************************************************/

/* Primary aliases for GPIO PA1 pin */
#define SA0_PORT                                        HAL_GPIOA
#define SA0_PIN                                         HAL_GPIO_PIN_1
#define SA0_INIT_STATE                                  HAL_GPIO_PIN_RESET
#define SA0_ACTIVE_STATE                                HAL_GPIO_PIN_SET
#define SA0_INACTIVE_STATE                              HAL_GPIO_PIN_RESET

/* Primary aliases for GPIO PA6 pin */
#define CS2_PORT                                        HAL_GPIOA
#define CS2_PIN                                         HAL_GPIO_PIN_6
#define CS2_INIT_STATE                                  HAL_GPIO_PIN_RESET
#define CS2_ACTIVE_STATE                                HAL_GPIO_PIN_SET
#define CS2_INACTIVE_STATE                              HAL_GPIO_PIN_RESET

/* Primary aliases for GPIO PB2 pin */
#define CS1_PORT                                        HAL_GPIOB
#define CS1_PIN                                         HAL_GPIO_PIN_2
#define CS1_INIT_STATE                                  HAL_GPIO_PIN_RESET
#define CS1_ACTIVE_STATE                                HAL_GPIO_PIN_SET
#define CS1_INACTIVE_STATE                              HAL_GPIO_PIN_RESET

/* Exported macros -----------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
/******************************************************************************/
/* Exported functions for gpio_default in HAL layer                           */
/******************************************************************************/
/**
  * @brief mx_gpio_default init function
  * This function configures the hardware resources used in this example
  * @retval 0  GPIO group correctly initialized
  * @retval -1 Issue detected during GPIO group initialization
  */
system_status_t mx_gpio_default_init(void);

/**
  * @brief  De-initialize gpio_default instance.
  */
system_status_t mx_gpio_default_deinit(void);

/**
  * @brief  Get the EXTI0 object.
  * @retval Pointer on the EXTI0 Handle
  */
hal_exti_handle_t *mx_gpio_default_exti0_gethandle(void);

/******************************************************************************/
/*                            EXTI Line0 interrupt                            */
/******************************************************************************/
void EXTI0_IRQHandler(void);

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* MX_GPIO_DEFAULT_H */
